Tekla Open API Reference for Tekla Structures 2025
DetailTypeAttribute Properties
The DetailTypeAttribute type exposes the following members.
Properties
Name | Description
Type
 The custom attribute [DetailType()] uses this to store the type of the detail to the system. This is not to be used by itself.
Top
See Also
Reference
DetailTypeAttribute Class
Tekla.Structures.Plugins Namespace